{
  "id": "doc-political-economic-and-ideological-factors-in-the-cold-war-1945-1991-1751316807511-1",
  "title": "Political, Economic, and Ideological Factors in the Cold War (1945-1991)",
  "author": "Carlos O'Hara Sr.",
  "pages": [
    {
      "number": 1,
      "content": "Introduction The Cold War, a prolonged conflict between the United States and the Soviet Union from 1945 to 1991, was fueled by a complex interplay of political rivalry, economic competition, and ideological incompatibility. Emerging from the ashes of World War II, the U.S. and the USSR represented fundamentally opposing systems — capitalist democracy versus Marxist-Leninist communism. These ideological di ff erences underpinned global conflicts, influenced economic policies, and fueled political maneuvers from Europe to Asia and beyond. Ultimately, the Cold War was not only a geopolitical struggle for influence, but also a competition over whose economic and ideological model would define the postwar world. Political Rivalry and the Division of Europe The political division of Europe, symbolized by the Iron Curtain , was a major catalyst for Cold War tensions. In 1946, Winston Churchill ʼ s \"Iron Curtain\" speech (Document A) warned of Soviet expansionism in Eastern Europe and urged Western nations to confront this threat. Churchill ʼ s speech highlighted the ideological divide but also reflected the growing political polarization between the former wartime allies. Politically, the U.S. sought to contain Soviet influence through alliances like NATO (1949), while the USSR established the Warsaw Pact in 1955 to solidify its control over Eastern Europe. The Truman Doctrine (Document B), articulated in 1947, further demonstrated the political element of the Cold War. President Truman framed the U.S. commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey. This policy of containment , which shaped American foreign policy for decades, was politically motivated by the belief that the survival of democratic governance required"
    },
    {
      "number": 2,
      "content": "resisting the spread of communism. Economic Competition and the Battle for Global Influence Economically, the Cold War was driven by competing visions for postwar reconstruction and development. The Marshall Plan (Document C), announced in 1947, provided over $12 billion in aid to rebuild Western European economies. While o ff icially framed as humanitarian assistance, the Marshall Plan had a clear economic and political objective: to strengthen capitalist economies and prevent them from turning to communism. The Soviet Union condemned the plan as imperialist, demonstrating how economic aid was a tool of ideological warfare . In response, the USSR implemented Comecon , its own economic organization to coordinate the economies of Eastern Bloc nations. The rivalry between capitalist and centrally planned economies extended beyond Europe. In newly decolonized nations in Africa, Asia, and Latin America, both superpowers o ff ered economic aid and trade agreements to gain influence. The Cold War economy was thus globalized, as the U.S. promoted free-market capitalism while the USSR sought to spread socialist development models. Ideological Incompatibility and Global Proxy Conflicts At the heart of the Cold War was a fundamental ideological clash between liberal democracy and communism . This ideological tension shaped the rhetoric, propaganda, and military engagements of the era. Soviet Premier Nikita Khrushchev ʼ s 1956 speech promising to \"bury\" capitalism (Document D) exemplifies the aggressive ideological posturing that characterized Soviet policy. Khrushchev ʼ s stance reflects the Marxist belief in the inevitable collapse of capitalism , an idea that fueled Soviet interventionism from Cuba to Vietnam . The U.S. also framed its interventions in ideological terms, portraying itself as the defender of freedom and democracy . The Cuban Missile Crisis (Document E) in 1962 illustrated the ideological stakes of"
    },
    {
      "number": 3,
      "content": "the Cold War, as Soviet e ff orts to arm Cuba were seen by the U.S. as both a military and ideological provocation. While the immediate conflict was resolved through diplomacy, the broader ideological struggle continued to define global politics. The Global Impact of the Cold War The Cold War ʼ s political, economic, and ideological tensions shaped not only the superpowers ʼ policies but also the fates of developing nations . In Korea (1950-1953) and Vietnam (1955-1975), ideological competition between communism and capitalism played out in bloody proxy wars . In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpowers against each other to gain economic and military aid, demonstrating how the Cold War became a global contest for influence. At the same time, ideological propaganda saturated media and culture within both blocs. From Hollywood anti-communist films to Soviet denunciations of American imperialism, both sides used culture to reinforce ideological loyalty at home and abroad. This pervasive ideological battle ensured that even non-military aspects of life — from education to art — were influenced by Cold War dynamics. Conclusion The Cold War was driven by the interplay of political rivalry, economic competition, and ideological conflict . Politically, the division of Europe and the formation of opposing alliances created a world defined by two hostile camps. Economically, both superpowers used aid and trade as weapons to win influence across the globe. Ideologically, the clash between capitalism and communism provided the moral framework for decades of tension, proxy wars, and arms races. While the Cold War ended with the collapse of the Soviet Union in 1991, its legacy continues to shape global politics, economics, and ideology in the 21st century."
    }
  ],
  "matchCards": [
    {
      "id": "mc1",
      "sourceType": "Internet",
      "sourceName": "JSTOR",
      "sourceUrl": "https://jstor.org/jstor/insight/75",
      "matchCount": 3,
      "similarityPercent": 7,
      "matchedWordCount": 58,
      "matches": [
        {
          "highlightId": "h1",
          "contextBefore": "ical tensions shaped not only the superpowers ʼ policies but also the fates of developing nations . ",
          "matchedText": "In Korea (1950-1953) and Vietnam (1955-1975), ideological competition between communism and capitalism played out in bloody proxy wars .",
          "contextAfter": " In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpower"
        },
        {
          "highlightId": "h2",
          "contextBefore": "ism (Document D) exemplifies the aggressive ideological posturing that characterized Soviet policy. ",
          "matchedText": "Khrushchev ʼ s stance reflects the Marxist belief in the inevitable collapse of capitalism , an idea that fueled Soviet interventionism from Cuba to Vietnam .",
          "contextAfter": " The U.S. also framed its interventions in ideological terms, portraying itself as the defender of f"
        },
        {
          "highlightId": "h3",
          "contextBefore": "heart of the Cold War was a fundamental ideological clash between liberal democracy and communism . ",
          "matchedText": "This ideological tension shaped the rhetoric, propaganda, and military engagements of the era.",
          "contextAfter": " Soviet Premier Nikita Khrushchev ʼ s 1956 speech promising to \"bury\" capitalism (Document D) exempl"
        }
      ]
    },
    {
      "id": "mc2",
      "sourceType": "Publication",
      "sourceName": "ResearchGate",
      "sourceUrl": "https://researchgate.com/article/8926",
      "matchCount": 4,
      "similarityPercent": 9,
      "matchedWordCount": 74,
      "matches": [
        {
          "highlightId": "h4",
          "contextBefore": "collapse of capitalism , an idea that fueled Soviet interventionism from Cuba to Vietnam . The U.S. ",
          "matchedText": "also framed its interventions in ideological terms, portraying itself as the defender of freedom and democracy .",
          "contextAfter": " The Cuban Missile Crisis (Document E) in 1962 illustrated the ideological stakes of"
        },
        {
          "highlightId": "h5",
          "contextBefore": "warned of Soviet expansionism in Eastern Europe and urged Western nations to confront this threat. ",
          "matchedText": "Churchill ʼ s speech highlighted the ideological divide but also reflected the growing political polarization between the former wartime allies.",
          "contextAfter": " Politically, the U.S. sought to contain Soviet influence through alliances like NATO (1949), while"
        },
        {
          "highlightId": "h6",
          "contextBefore": "c aid and trade agreements to gain influence. The Cold War economy was thus globalized, as the U.S. ",
          "matchedText": "promoted free-market capitalism while the USSR sought to spread socialist development models.",
          "contextAfter": " Ideological Incompatibility and Global Proxy Conflicts At the heart of the Cold War was a fundament"
        },
        {
          "highlightId": "h7",
          "contextBefore": "1947, further demonstrated the political element of the Cold War. President Truman framed the U.S. ",
          "matchedText": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
          "contextAfter": " This policy of containment , which shaped American foreign policy for decades, was politically moti"
        }
      ]
    },
    {
      "id": "mc3",
      "sourceType": "Submitted Works",
      "sourceName": "Submitted to Another Institution - 2022 November 29",
      "sourceUrl": "https://www.wikipedia.net/posts/1751315848035",
      "matchCount": 3,
      "similarityPercent": 9,
      "matchedWordCount": 77,
      "matches": [
        {
          "highlightId": "h8",
          "contextBefore": "5-1975), ideological competition between communism and capitalism played out in bloody proxy wars . ",
          "matchedText": "In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpowers against each other to gain economic and military aid, demonstrating how the Cold War became a global contest for influence.",
          "contextAfter": " At the same time, ideological propaganda saturated media and culture within both blocs. From Hollyw"
        },
        {
          "highlightId": "h9",
          "contextBefore": "t even non-military aspects of life — from education to art — were influenced by Cold War dynamics. ",
          "matchedText": "Conclusion The Cold War was driven by the interplay of political rivalry, economic competition, and ideological conflict .",
          "contextAfter": " Politically, the division of Europe and the formation of opposing alliances created a world defined"
        },
        {
          "highlightId": "h10",
          "contextBefore": "epresented fundamentally opposing systems — capitalist democracy versus Marxist-Leninist communism. ",
          "matchedText": "These ideological di ff erences underpinned global conflicts, influenced economic policies, and fueled political maneuvers from Europe to Asia and beyond.",
          "contextAfter": " Ultimately, the Cold War was not only a geopolitical struggle for influence, but also a competition"
        }
      ]
    },
    {
      "id": "mc4",
      "sourceType": "Publication",
      "sourceName": "Journal of Climate Science",
      "sourceUrl": "https://journal.com/article/5981",
      "matchCount": 2,
      "similarityPercent": 6,
      "matchedWordCount": 55,
      "matches": [
        {
          "highlightId": "h11",
          "contextBefore": "lism and communism provided the moral framework for decades of tension, proxy wars, and arms races. ",
          "matchedText": "While the Cold War ended with the collapse of the Soviet Union in 1991, its legacy continues to shape global politics, economics, and ideology in the 21st century.",
          "contextAfter": ""
        },
        {
          "highlightId": "h12",
          "contextBefore": "licts, influenced economic policies, and fueled political maneuvers from Europe to Asia and beyond. ",
          "matchedText": "Ultimately, the Cold War was not only a geopolitical struggle for influence, but also a competition over whose economic and ideological model would define the postwar world.",
          "contextAfter": " Political Rivalry and the Division of Europe The political division of Europe, symbolized by the Ir"
        }
      ]
    },
    {
      "id": "mc5",
      "sourceType": "Internet",
      "sourceName": "EduBlog.org",
      "sourceUrl": "https://edublog.org/edublog/insight/381",
      "matchCount": 4,
      "similarityPercent": 7,
      "matchedWordCount": 63,
      "matches": [
        {
          "highlightId": "h13",
          "contextBefore": "mented Comecon , its own economic organization to coordinate the economies of Eastern Bloc nations. ",
          "matchedText": "The rivalry between capitalist and centrally planned economies extended beyond Europe.",
          "contextAfter": " In newly decolonized nations in Africa, Asia, and Latin America, both superpowers o ff ered economi"
        },
        {
          "highlightId": "h14",
          "contextBefore": "1947, further demonstrated the political element of the Cold War. President Truman framed the U.S. ",
          "matchedText": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
          "contextAfter": " This policy of containment , which shaped American foreign policy for decades, was politically moti"
        },
        {
          "highlightId": "h15",
          "contextBefore": "and Latin America, both superpowers o ff ered economic aid and trade agreements to gain influence. ",
          "matchedText": "The Cold War economy was thus globalized, as the U.",
          "contextAfter": "S. promoted free-market capitalism while the USSR sought to spread socialist development models. Ide"
        },
        {
          "highlightId": "h16",
          "contextBefore": "9), while the USSR established the Warsaw Pact in 1955 to solidify its control over Eastern Europe. ",
          "matchedText": "The Truman Doctrine (Document B), articulated in 1947, further demonstrated the political element of the Cold War.",
          "contextAfter": " President Truman framed the U.S. commitment to assist nations resisting \"attempted subjugation by a"
        }
      ]
    },
    {
      "id": "mc6",
      "sourceType": "Internet",
      "sourceName": "Google Scholar",
      "sourceUrl": "https://google.org/google/insight/793",
      "matchCount": 5,
      "similarityPercent": 14,
      "matchedWordCount": 121,
      "matches": [
        {
          "highlightId": "h17",
          "contextBefore": "1947, further demonstrated the political element of the Cold War. President Truman framed the U.S. ",
          "matchedText": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
          "contextAfter": " This policy of containment , which shaped American foreign policy for decades, was politically moti"
        },
        {
          "highlightId": "h18",
          "contextBefore": "by a complex interplay of political rivalry, economic competition, and ideological incompatibility. ",
          "matchedText": "Emerging from the ashes of World War II, the U.",
          "contextAfter": "S. and the USSR represented fundamentally opposing systems — capitalist democracy versus Marxist-Len"
        },
        {
          "highlightId": "h19",
          "contextBefore": "5-1975), ideological competition between communism and capitalism played out in bloody proxy wars . ",
          "matchedText": "In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpowers against each other to gain economic and military aid, demonstrating how the Cold War became a global contest for influence.",
          "contextAfter": " At the same time, ideological propaganda saturated media and culture within both blocs. From Hollyw"
        },
        {
          "highlightId": "h20",
          "contextBefore": "1947, further demonstrated the political element of the Cold War. President Truman framed the U.S. ",
          "matchedText": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
          "contextAfter": " This policy of containment , which shaped American foreign policy for decades, was politically moti"
        },
        {
          "highlightId": "h21",
          "contextBefore": "sm . This ideological tension shaped the rhetoric, propaganda, and military engagements of the era. ",
          "matchedText": "Soviet Premier Nikita Khrushchev ʼ s 1956 speech promising to \"bury\" capitalism (Document D) exemplifies the aggressive ideological posturing that characterized Soviet policy.",
          "contextAfter": " Khrushchev ʼ s stance reflects the Marxist belief in the inevitable collapse of capitalism , an ide"
        }
      ]
    },
    {
      "id": "mc7",
      "sourceType": "Publication",
      "sourceName": "Springer Link",
      "sourceUrl": "https://springer.org/springer/insight/890",
      "matchCount": 2,
      "similarityPercent": 5,
      "matchedWordCount": 43,
      "matches": [
        {
          "highlightId": "h22",
          "contextBefore": "ps. Economically, both superpowers used aid and trade as weapons to win influence across the globe. ",
          "matchedText": "Ideologically, the clash between capitalism and communism provided the moral framework for decades of tension, proxy wars, and arms races.",
          "contextAfter": " While the Cold War ended with the collapse of the Soviet Union in 1991, its legacy continues to sha"
        },
        {
          "highlightId": "h23",
          "contextBefore": "sm . This ideological tension shaped the rhetoric, propaganda, and military engagements of the era. ",
          "matchedText": "Soviet Premier Nikita Khrushchev ʼ s 1956 speech promising to \"bury\" capitalism (Document D) exemplifies the aggressive ideological posturing that characterized Soviet policy.",
          "contextAfter": " Khrushchev ʼ s stance reflects the Marxist belief in the inevitable collapse of capitalism , an ide"
        }
      ]
    },
    {
      "id": "mc8",
      "sourceType": "Publication",
      "sourceName": "Cambridge Journals",
      "sourceUrl": "https://cambridge.org/cambridge/insight/343",
      "matchCount": 3,
      "similarityPercent": 5,
      "matchedWordCount": 45,
      "matches": [
        {
          "highlightId": "h24",
          "contextBefore": "the Cold War, as Soviet e ff orts to arm Cuba were seen by the U.S. ",
          "matchedText": "as both a military and ideological provocation.",
          "contextAfter": " While the immediate conflict was resolved through diplomacy, the broader ideological struggle conti"
        },
        {
          "highlightId": "h25",
          "contextBefore": "ical tensions shaped not only the superpowers ʼ policies but also the fates of developing nations . ",
          "matchedText": "In Korea (1950-1953) and Vietnam (1955-1975), ideological competition between communism and capitalism played out in bloody proxy wars .",
          "contextAfter": " In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpower"
        },
        {
          "highlightId": "h26",
          "contextBefore": "ical tensions shaped not only the superpowers ʼ policies but also the fates of developing nations . ",
          "matchedText": "In Korea (1950-1953) and Vietnam (1955-1975), ideological competition between communism and capitalism played out in bloody proxy wars .",
          "contextAfter": " In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpower"
        }
      ]
    }
  ],
  "highlights": [
    {
      "id": "h1",
      "page": 3,
      "startOffset": 430,
      "endOffset": 566,
      "text": "In Korea (1950-1953) and Vietnam (1955-1975), ideological competition between communism and capitalism played out in bloody proxy wars .",
      "isExcluded": false,
      "matchCardId": "mc1"
    },
    {
      "id": "h2",
      "page": 2,
      "startOffset": 1574,
      "endOffset": 1732,
      "text": "Khrushchev ʼ s stance reflects the Marxist belief in the inevitable collapse of capitalism , an idea that fueled Soviet interventionism from Cuba to Vietnam .",
      "isExcluded": false,
      "matchCardId": "mc1"
    },
    {
      "id": "h3",
      "page": 2,
      "startOffset": 1303,
      "endOffset": 1397,
      "text": "This ideological tension shaped the rhetoric, propaganda, and military engagements of the era.",
      "isExcluded": false,
      "matchCardId": "mc1"
    },
    {
      "id": "h4",
      "page": 2,
      "startOffset": 1742,
      "endOffset": 1854,
      "text": "also framed its interventions in ideological terms, portraying itself as the defender of freedom and democracy .",
      "isExcluded": false,
      "matchCardId": "mc2"
    },
    {
      "id": "h5",
      "page": 1,
      "startOffset": 1112,
      "endOffset": 1256,
      "text": "Churchill ʼ s speech highlighted the ideological divide but also reflected the growing political polarization between the former wartime allies.",
      "isExcluded": false,
      "matchCardId": "mc2"
    },
    {
      "id": "h6",
      "page": 2,
      "startOffset": 1047,
      "endOffset": 1140,
      "text": "promoted free-market capitalism while the USSR sought to spread socialist development models.",
      "isExcluded": false,
      "matchCardId": "mc2"
    },
    {
      "id": "h7",
      "page": 1,
      "startOffset": 1594,
      "endOffset": 1776,
      "text": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
      "isExcluded": false,
      "matchCardId": "mc2"
    },
    {
      "id": "h8",
      "page": 3,
      "startOffset": 567,
      "endOffset": 791,
      "text": "In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpowers against each other to gain economic and military aid, demonstrating how the Cold War became a global contest for influence.",
      "isExcluded": false,
      "matchCardId": "mc3"
    },
    {
      "id": "h9",
      "page": 3,
      "startOffset": 1187,
      "endOffset": 1309,
      "text": "Conclusion The Cold War was driven by the interplay of political rivalry, economic competition, and ideological conflict .",
      "isExcluded": false,
      "matchCardId": "mc3"
    },
    {
      "id": "h10",
      "page": 1,
      "startOffset": 462,
      "endOffset": 616,
      "text": "These ideological di ff erences underpinned global conflicts, influenced economic policies, and fueled political maneuvers from Europe to Asia and beyond.",
      "isExcluded": false,
      "matchCardId": "mc3"
    },
    {
      "id": "h11",
      "page": 3,
      "startOffset": 1667,
      "endOffset": 1830,
      "text": "While the Cold War ended with the collapse of the Soviet Union in 1991, its legacy continues to shape global politics, economics, and ideology in the 21st century.",
      "isExcluded": false,
      "matchCardId": "mc4"
    },
    {
      "id": "h12",
      "page": 1,
      "startOffset": 617,
      "endOffset": 790,
      "text": "Ultimately, the Cold War was not only a geopolitical struggle for influence, but also a competition over whose economic and ideological model would define the postwar world.",
      "isExcluded": false,
      "matchCardId": "mc4"
    },
    {
      "id": "h13",
      "page": 2,
      "startOffset": 761,
      "endOffset": 847,
      "text": "The rivalry between capitalist and centrally planned economies extended beyond Europe.",
      "isExcluded": false,
      "matchCardId": "mc5"
    },
    {
      "id": "h14",
      "page": 1,
      "startOffset": 1594,
      "endOffset": 1776,
      "text": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
      "isExcluded": false,
      "matchCardId": "mc5"
    },
    {
      "id": "h15",
      "page": 2,
      "startOffset": 993,
      "endOffset": 1044,
      "text": "The Cold War economy was thus globalized, as the U.",
      "isExcluded": false,
      "matchCardId": "mc5"
    },
    {
      "id": "h16",
      "page": 1,
      "startOffset": 1446,
      "endOffset": 1560,
      "text": "The Truman Doctrine (Document B), articulated in 1947, further demonstrated the political element of the Cold War.",
      "isExcluded": false,
      "matchCardId": "mc5"
    },
    {
      "id": "h17",
      "page": 1,
      "startOffset": 1594,
      "endOffset": 1776,
      "text": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
      "isExcluded": false,
      "matchCardId": "mc6"
    },
    {
      "id": "h18",
      "page": 1,
      "startOffset": 298,
      "endOffset": 345,
      "text": "Emerging from the ashes of World War II, the U.",
      "isExcluded": false,
      "matchCardId": "mc6"
    },
    {
      "id": "h19",
      "page": 3,
      "startOffset": 567,
      "endOffset": 791,
      "text": "In non-aligned nations , leaders such as Egypt ʼ s Gamal Abdel Nasser sought to play the superpowers against each other to gain economic and military aid, demonstrating how the Cold War became a global contest for influence.",
      "isExcluded": false,
      "matchCardId": "mc6"
    },
    {
      "id": "h20",
      "page": 1,
      "startOffset": 1594,
      "endOffset": 1776,
      "text": "commitment to assist nations resisting \"attempted subjugation by armed minorities or outside pressures\" — a clear reference to Soviet-backed communist movements in Greece and Turkey.",
      "isExcluded": false,
      "matchCardId": "mc6"
    },
    {
      "id": "h21",
      "page": 2,
      "startOffset": 1398,
      "endOffset": 1573,
      "text": "Soviet Premier Nikita Khrushchev ʼ s 1956 speech promising to \"bury\" capitalism (Document D) exemplifies the aggressive ideological posturing that characterized Soviet policy.",
      "isExcluded": false,
      "matchCardId": "mc6"
    },
    {
      "id": "h22",
      "page": 3,
      "startOffset": 1528,
      "endOffset": 1666,
      "text": "Ideologically, the clash between capitalism and communism provided the moral framework for decades of tension, proxy wars, and arms races.",
      "isExcluded": false,
      "matchCardId": "mc7"
    },
    {
      "id": "h23",
      "page": 2,
      "startOffset": 1398,
      "endOffset": 1573,
      "text": "Soviet Premier Nikita Khrushchev ʼ s 1956 speech promising to \"bury\" capitalism (Document D) exemplifies the aggressive ideological posturing that characterized Soviet policy.",
      "isExcluded": false,
      "matchCardId": "mc7"
    },
    {
      "id": "h24",
      "page": 3,
      "startOffset": 68,
      "endOffset": 115,
      "text": "as both a military and ideological provocation.",
      "isExcluded": false,
      "matchCardId": "mc8"
    },
    {
      "id": "h25",
      "page": 3,
      "startOffset": 430,
      "endOffset": 566,
      "text": "In Korea (1950-1953) and Vietnam (1955-1975), ideological competition between communism and capitalism played out in bloody proxy wars .",
      "isExcluded": false,
      "matchCardId": "mc8"
    },
    {
      "id": "h26",
      "page": 3,
      "startOffset": 430,
      "endOffset": 566,
      "text": "In Korea (1950-1953) and Vietnam (1955-1975), ideological competition between communism and capitalism played out in bloody proxy wars .",
      "isExcluded": false,
      "matchCardId": "mc8"
    }
  ]
}